/*****************************************************************************/
/* ntdll.h                           Copyright (c) Ladislav Zezula 2005-2025 */
/*---------------------------------------------------------------------------*/
/* Header file for the import library "ntdll.lib"                            */
/*                                                                           */
/* This library has been created because of never-ending problems when       */
/* Ntdll.lib from Windows DDK with SDK libs (duplicate symbols, linker       */
/* errors etc).                                                              */
/* Now, it is possible to use native NT API with no problems, all you need   */
/* is just to include ntdll.h and link ntdll.lib from this project.          */
/*---------------------------------------------------------------------------*/
/*   Date    Ver   Who  Comment                                              */
/* --------  ----  ---  -------                                              */
/* 15.05.03  1.00  Lad  Created                                              */
/* 16.09.05  2.00  Lad  Far more functions                                   */
/*****************************************************************************/

#ifndef __NTDLL_H__
#define __NTDLL_H__

#ifdef __cplusplus
extern "C" {
#endif

#ifdef _NTDDK_
#error This header cannot be compiled together with NTDDK
#endif

#ifndef _NTDLL_SELF_                            // Auto-insert the library
#pragma comment(lib, "Ntdll.lib")
#endif

#ifdef _MSC_VER
#pragma warning(disable: 4201)                  // nonstandard extension used : nameless struct/union
#pragma warning(disable: 4214)                  // nonstandard extension used : bit field types other than int
#endif

//------------------------------------------------------------------------------
// Defines for NTSTATUS

#ifdef _Return_type_success_
typedef _Return_type_success_(return >= 0) LONG NTSTATUS;
#else
typedef LONG NTSTATUS;
#endif

#ifndef NT_SUCCESS
#define NT_SUCCESS(Status)   ((NTSTATUS)(Status) >= 0)
#endif

#ifndef STATUS_SUCCESS
#define STATUS_SUCCESS       ((NTSTATUS)0x00000000L)
#endif

#ifndef STATUS_UNSUCCESSFUL
#define STATUS_UNSUCCESSFUL  ((NTSTATUS)0xC0000001L)
#endif

#ifndef ASSERT
#ifdef _DEBUG
#define ASSERT(x) assert(x)
#else
#define ASSERT(x) /* x */
#endif
#endif

#ifndef DEVICE_TYPE
#define DEVICE_TYPE DWORD
#endif

//-----------------------------------------------------------------------------
// Definition of intervals for waiting functions

#define ABSOLUTE_INTERVAL(wait) (wait)

#define RELATIVE_INTERVAL(wait) (-(wait))

#define NANOSECONDS(nanos) \
(((signed __int64)(nanos)) / 100L)

#define MICROSECONDS(micros) \
(((signed __int64)(micros)) * NANOSECONDS(1000L))

#define MILISECONDS(mili) \
(((signed __int64)(mili)) * MICROSECONDS(1000L))

#define SECONDS(seconds) \
(((signed __int64)(seconds)) * MILISECONDS(1000L))

//------------------------------------------------------------------------------
// Structures

#ifndef _NTDEF_
typedef enum _EVENT_TYPE
{
    NotificationEvent,
    SynchronizationEvent
} EVENT_TYPE;

//
// ANSI strings are counted 8-bit character strings. If they are
// NULL terminated, Length does not include trailing NULL.
//

typedef struct _STRING
{
    USHORT Length;
    USHORT MaximumLength;
    PCHAR  Buffer;
} STRING, *PSTRING;

//
// Unicode strings are counted 16-bit character strings. If they are
// NULL terminated, Length does not include trailing NULL.
//

typedef struct _UNICODE_STRING
{
    USHORT Length;
    USHORT MaximumLength;
    PWSTR  Buffer;
} UNICODE_STRING, *PUNICODE_STRING;

//
// Bitmap type
//

typedef struct _RTL_BITMAP
{
    ULONG SizeOfBitmap;
    PULONG Buffer;
} RTL_BITMAP, *PRTL_BITMAP;

//
// Preallocated heap-growable buffers
//

typedef struct _RTL_BUFFER
{
    PUCHAR    Buffer;
    PUCHAR    StaticBuffer;
    SIZE_T    Size;
    SIZE_T    StaticSize;
    SIZE_T    ReservedForAllocatedSize;     // for future doubling
    PVOID     ReservedForIMalloc;           // for future pluggable growth
} RTL_BUFFER, *PRTL_BUFFER;

//
// A preallocated buffer that is "tied" to a UNICODE_STRING
//

typedef struct _RTL_UNICODE_STRING_BUFFER
{
    UNICODE_STRING String;
    RTL_BUFFER     ByteBuffer;
    UCHAR          MinimumStaticBufferForTerminalNul[sizeof(WCHAR)];

} RTL_UNICODE_STRING_BUFFER, *PRTL_UNICODE_STRING_BUFFER;

typedef STRING ANSI_STRING;
typedef PSTRING PANSI_STRING;

typedef STRING OEM_STRING;
typedef PSTRING POEM_STRING;
typedef CONST STRING* PCOEM_STRING;

typedef const UNICODE_STRING *PCUNICODE_STRING;

#define UNICODE_NULL ((WCHAR)0) // winnt

#ifndef RTL_CONSTANT_STRING         // UNICODE_STRING FooStr = RTL_CONSTANT_STRING(L"Foo");
#define RTL_CONSTANT_STRING(str)    {(USHORT)(sizeof(str) - sizeof(str[0])), (USHORT)(sizeof(str)), str}
#endif  // RTL_CONSTANT_STRING

//
// Definitions for Object Creation
//

#define OBJ_PROTECT_CLOSE                       0x00000001L
#define OBJ_INHERIT                             0x00000002L
#define OBJ_AUDIT_OBJECT_CLOSE                  0x00000004L
#define OBJ_NO_RIGHTS_UPGRADE                   0x00000008L
#define OBJ_PERMANENT                           0x00000010L
#define OBJ_EXCLUSIVE                           0x00000020L
#define OBJ_CASE_INSENSITIVE                    0x00000040L
#define OBJ_OPENIF                              0x00000080L
#define OBJ_OPENLINK                            0x00000100L
#define OBJ_KERNEL_HANDLE                       0x00000200L
#define OBJ_FORCE_ACCESS_CHECK                  0x00000400L
#define OBJ_IGNORE_IMPERSONATED_DEVICEMAP       0x00000800L
#define OBJ_DONT_REPARSE                        0x00001000L
#define OBJ_KERNEL_EXCLUSIVE                    0x00010000L

//
// Object Attributes structure
//

typedef struct _OBJECT_ATTRIBUTES
{
    ULONG Length;
    HANDLE RootDirectory;
    PUNICODE_STRING ObjectName;
    ULONG Attributes;
    PVOID SecurityDescriptor;        // Points to type SECURITY_DESCRIPTOR
    PVOID SecurityQualityOfService;  // Points to type SECURITY_QUALITY_OF_SERVICE
} OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES;

//
// IO_STATUS_BLOCK
//

typedef struct _IO_STATUS_BLOCK
{
    union
    {
        NTSTATUS Status;
        PVOID Pointer;
    };

    ULONG_PTR Information;

} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK;

//
// ClientId
//

typedef struct _CLIENT_ID
{
    HANDLE UniqueProcess;
    HANDLE UniqueThread;
} CLIENT_ID, *PCLIENT_ID;
#endif // _NTDEF_

/*
typedef struct _IMAGE_RELOC
{
    WORD offset : 12;
    WORD type : 4;
} IMAGE_RELOC, *PIMAGE_RELOC;
*/

//
// KUSER_SHARED_DATA from ntdll.dll version 10.0.14361.1000 (rs1_release_prs.160603-2123)
//

typedef enum _NT_PRODUCT_TYPE
{
    NtProductWinNt = 1,
    NtProductLanManNt = 2,
    NtProductServer = 3

} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
    StandardDesign = 0,
    NEC98x86 = 1,
    EndAlternatives = 2

} ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef struct _KSYSTEM_TIME
{
    ULONG LowPart;
    LONG High1Time;
    LONG High2Time;

} KSYSTEM_TIME, *PKSYSTEM_TIME;

#if _MSC_VER <= 1500

#define MAXIMUM_XSTATE_FEATURES             (64)

typedef struct _PROCESSOR_NUMBER
{
    USHORT Group;
    UCHAR Number;
    UCHAR Reserved;
} PROCESSOR_NUMBER;

typedef struct _XSTATE_FEATURE
{
    DWORD Offset;
    DWORD Size;
} XSTATE_FEATURE, * PXSTATE_FEATURE;

typedef struct _XSTATE_CONFIGURATION
{
    DWORD64 EnabledFeatures;
    DWORD64 EnabledVolatileFeatures;
    DWORD   Size;

    // Control Flags
    union
    {
        DWORD ControlFlags;
        struct
        {
            DWORD OptimizedSave : 1;
            DWORD CompactionEnabled : 1;
            DWORD ExtendedFeatureDisable : 1;
        } DUMMYSTRUCTNAME;
    } DUMMYUNIONNAME;

    // List of features
    XSTATE_FEATURE Features[MAXIMUM_XSTATE_FEATURES];

    // Mask of all supervisor features
    DWORD64 EnabledSupervisorFeatures;

    // Mask of features that require start address to be 64 byte aligned
    DWORD64 AlignedFeatures;

    // Total size of the save area for user and supervisor states
    DWORD AllFeatureSize;

    // List which holds size of each user and supervisor state supported by CPU
    DWORD AllFeatures[MAXIMUM_XSTATE_FEATURES];

    // Mask of all supervisor features that are exposed to user-mode
    DWORD64 EnabledUserVisibleSupervisorFeatures;

    // Mask of features that can be disabled via XFD
    DWORD64 ExtendedFeatureDisableFeatures;

    // Total size of the save area for non-large user and supervisor states
    DWORD AllNonLargeFeatureSize;

    // The maximum supported ARM64 SVE vector length that can be used in the
    // current environment, in bytes.
    WORD   MaxSveVectorLength;
    WORD   Spare1;
} XSTATE_CONFIGURATION, * PXSTATE_CONFIGURATION;
#endif

#pragma pack(push, 4)
typedef struct _KUSER_SHARED_DATA
{
    /* 0x000 */ ULONG TickCountLowDeprecated;
    /* 0x004 */ ULONG TickCountMultiplier;
    /* 0x008 */ KSYSTEM_TIME InterruptTime;
    /* 0x014 */ KSYSTEM_TIME SystemTime;
    /* 0x020 */ KSYSTEM_TIME TimeZoneBias;
    /* 0x02c */ USHORT ImageNumberLow;
    /* 0x02e */ USHORT ImageNumberHigh;
    /* 0x030 */ WCHAR NtSystemRoot[260];
    /* 0x238 */ ULONG MaxStackTraceDepth;
    /* 0x23c */ ULONG CryptoExponent;
    /* 0x240 */ ULONG TimeZoneId;
    /* 0x244 */ ULONG LargePageMinimum;
    /* 0x248 */ ULONG AitSamplingValue;
    /* 0x24c */ ULONG AppCompatFlag;
    /* 0x250 */ ULONGLONG RNGSeedVersion;
    /* 0x258 */ ULONG GlobalValidationRunlevel;
    /* 0x25c */ LONG TimeZoneBiasStamp;
    /* 0x260 */ ULONG NtBuildNumber;
    /* 0x264 */ NT_PRODUCT_TYPE NtProductType;
    /* 0x268 */ UCHAR ProductTypeIsValid;
    /* 0x269 */ UCHAR Reserved0[1];
    /* 0x26a */ USHORT NativeProcessorArchitecture;
    /* 0x26c */ ULONG NtMajorVersion;
    /* 0x270 */ ULONG NtMinorVersion;
    /* 0x274 */ UCHAR ProcessorFeatures[64];
    /* 0x2b4 */ ULONG Reserved1;
    /* 0x2b8 */ ULONG Reserved3;
    /* 0x2bc */ ULONG TimeSlip;
    /* 0x2c0 */ ALTERNATIVE_ARCHITECTURE_TYPE AlternativeArchitecture;
    /* 0x2c4 */ ULONG BootId;
    /* 0x2c8 */ LARGE_INTEGER SystemExpirationDate;
    /* 0x2d0 */ ULONG SuiteMask;
    /* 0x2d4 */ BOOLEAN KdDebuggerEnabled;

    /* 0x2d5 */ union
                {
                    UCHAR MitigationPolicies;
                    struct
                    {
                        UCHAR NXSupportPolicy:2;
                        UCHAR SEHValidationPolicy:2;
                        UCHAR CurDirDevicesSkippedForDlls:2;
                        UCHAR Reserved:2;
                    };
                };

    /* 0x2d6 */ UCHAR Reserved6[2];
    /* 0x2d8 */ ULONG ActiveConsoleId;
    /* 0x2dc */ ULONG DismountCount;
    /* 0x2e0 */ ULONG ComPlusPackage;
    /* 0x2e4 */ ULONG LastSystemRITEventTickCount;
    /* 0x2e8 */ ULONG NumberOfPhysicalPages;
    /* 0x2ec */ UCHAR SafeBootMode;
    /* 0x2ed */ UCHAR Reserved12;

    /* 0x2f0 */ union
                {
                    ULONG SharedDataFlags;
                    struct
                    {
                        ULONG DbgErrorPortPresent : 1;
                        ULONG DbgElevationEnabled : 1;
                        ULONG DbgVirtEnabled : 1;
                        ULONG DbgInstallerDetectEnabled : 1;
                        ULONG DbgLkgEnabled : 1;
                        ULONG DbgDynProcessorEnabled : 1;
                        ULONG DbgConsoleBrokerEnabled : 1;
                        ULONG DbgSecureBootEnabled : 1;
                        ULONG DbgMultiSessionSku : 1;
                        ULONG DbgMultiUsersInSessionSku : 1;
                        ULONG DbgStateSeparationEnabled : 1;
                        ULONG SpareBits : 21;
                    };
                };

    /* 0x2f4 */ ULONG DataFlagsPad[1];
    /* 0x2f8 */ ULONGLONG TestRetInstruction;
    /* 0x300 */ ULONGLONG QpcFrequency;
    /* 0x308 */ ULONG SystemCall;
    /* 0x30C */ ULONG SystemCallPad0;
    /* 0x310 */ ULONGLONG SystemCallPad[2];

    /* 0x320 */ union
                {
                    KSYSTEM_TIME TickCount;
                    ULONGLONG TickCountQuad;
                    ULONG ReservedTickCountOverlay[3];
                };

    /* 0x32c */ ULONG TickCountPad[1];
    /* 0x330 */ ULONG Cookie;
    /* 0x334 */ ULONG CookiePad[1];
    /* 0x338 */ ULONGLONG ConsoleSessionForegroundProcessId;
    /* 0x340 */ ULONGLONG TimeUpdateLock;
    /* 0x348 */ ULONGLONG BaselineSystemTimeQpc;
    /* 0x350 */ ULONGLONG BaselineInterruptTimeQpc;
    /* 0x358 */ ULONGLONG QpcSystemTimeIncrement;
    /* 0x360 */ ULONGLONG QpcInterruptTimeIncrement;
    /* 0x368 */ UCHAR QpcSystemTimeIncrementShift;
    /* 0x369 */ UCHAR QpcInterruptTimeIncrementShift;
    /* 0x36a */ USHORT UnparkedProcessorCount;
    /* 0x36c */ UCHAR Reserved8[20];
    /* 0x380 */ USHORT UserModeGlobalLogger[16];
    /* 0x3a0 */ ULONG ImageFileExecutionOptions;
    /* 0x3a4 */ ULONG LangGenerationCount;
    /* 0x3a8 */ ULONGLONG Reserved4;
    /* 0x3b0 */ ULONGLONG InterruptTimeBias;
    /* 0x3b8 */ ULONGLONG QpcBias;
    /* 0x3c0 */ ULONG ActiveProcessorCount;
    /* 0x3c4 */ UCHAR ActiveGroupCount;
    /* 0x3c5 */ UCHAR Reserved9;

    
    /* 0x3c6 */ union
                {
                    USHORT QpcData;
                    struct
                    {
                        BYTE QpcBypassEnabled;
                        BYTE QpcShift;
                    };
                };

    /* 0x3c8 */ LARGE_INTEGER TimeZoneBiasEffectiveStart;
    /* 0x3d0 */ LARGE_INTEGER TimeZoneBiasEffectiveEnd;
    /* 0x3d8 */ XSTATE_CONFIGURATION XState;
    /* 0x710 */ KSYSTEM_TIME FeatureConfigurationChangeStamp;

} KUSER_SHARED_DATA, *PKUSER_SHARED_DATA;
#pragma pack(pop)

//------------------------------------------------------------------------------
// Loader-related structures

//
// Process Environment Block
//

typedef struct _PEB_FREE_BLOCK
{
    struct _PEB_FREE_BLOCK * Next;
    ULONG Size;

} PEB_FREE_BLOCK, *PPEB_FREE_BLOCK;

// CURDIR structure
typedef struct _CURDIR
{
    UNICODE_STRING DosPath;
    HANDLE Handle;
} CURDIR, * PCURDIR;

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
    USHORT Flags;
    USHORT Length;
    ULONG  TimeStamp;
    STRING DosPath;

} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR;

typedef struct _PEB_LDR_DATA
{
    ULONG Length;
    BOOLEAN Initialized;
    HANDLE SsHandle;
    LIST_ENTRY InLoadOrderModuleList;               // Points to the loaded modules (main EXE usually)
    LIST_ENTRY InMemoryOrderModuleList;             // Points to all modules (EXE and all DLLs)
    LIST_ENTRY InInitializationOrderModuleList;
    PVOID      EntryInProgress;
    BOOLEAN    ShutdownInProgress;                  // Windows 10
    HANDLE     ShutdownThreadId;                    // Windows 10

} PEB_LDR_DATA, * PPEB_LDR_DATA;

#define LDRP_PACKED_BINARY              0x00000001
#define LDRP_MARKED_FOR_REMOVAL         0x00000002
#define LDRP_IMAGE_DLL                  0x00000004
#define LDRP_LOAD_NOTIFICATION_SENT     0x00000008
#define LDRP_TELEMETRY_ENTRY_PROCESSED  0x00000010
#define LDRP_PROCESS_STATIC_IMPORT      0x00000020
#define LDRP_IN_LEGACY_LISTS            0x00000040
#define LDRP_IN_INDEXES                 0x00000080
#define LDRP_SHIM_DLL                   0x00000100
#define LDRP_IN_EXCEPTION_TABLE         0x00000200
#define LDRP_RESERVED1                  0x00000400
#define LDRP_RESERVED2                  0x00000800
#define LDRP_LOAD_IN_PROGRESS           0x00001000
#define LDRP_LOAD_CONFIG_PROCESSED      0x00002000      // Was: LDRP_UNLOAD_IN_PROGRESS
#define LDRP_ENTRY_PROCESSED            0x00004000
#define LDRP_ENTRY_PROTECT_DELAY_LOAD   0x00008000      // Was: LDRP_ENTRY_INSERTED
#define LDRP_RESERVED3                  0x00010000
#define LDRP_RESERVED4                  0x00020000
#define LDRP_DONT_CALL_FOR_THREADS      0x00040000
#define LDRP_PROCESS_ATTACH_CALLED      0x00080000
#define LDRP_PROCESS_ATTACH_FAILED      0x00100000
#define LDRP_COR_DEFERRED_VALIDATE      0x00200000
#define LDRP_COR_IMAGE                  0x00400000
#define LDRP_DONT_RELOCATE              0x00800000
#define LDRP_COR_IL_ONLY                0x01000000
#define LDRP_RESERVED5                  0x02000000
#define LDRP_RESERVED6                  0x04000000
#define LDRP_RESERVED7                  0x08000000
#define LDRP_REDIRECTED                 0x10000000
#define LDRP_ENTRY_NATIVE               0x08000000
#define LDRP_REDIRECTED                 0x10000000
#define LDRP_RESERVED8                  0x20000000
#define LDRP_RESERVED9                  0x40000000      // Was: LDRP_MM_LOADED
#define LDRP_COMPAT_DATABASE_PROTECTED  0x80000000

typedef struct _RTL_BALANCED_NODE
{
    union
    {
        struct _RTL_BALANCED_NODE * Children[2];
        struct
        {
            struct _RTL_BALANCED_NODE * Left;
            struct _RTL_BALANCED_NODE * Right;
        };
    };
    union
    {
        struct
        {
            UCHAR Red : 1;
        };
        struct
        {
            UCHAR Balance:2;
        };
        ULONG ParentValue;
    };
} RTL_BALANCED_NODE, *PRTL_BALANCED_NODE;

typedef enum _LDR_DLL_LOAD_REASON
{
     LoadReasonStaticDependency = 0x0,
     LoadReasonStaticForwarderDependency = 0x1,
     LoadReasonDynamicForwarderDependency = 0x2,
     LoadReasonDelayloadDependency = 0x3,
     LoadReasonDynamicLoad = 0x4,
     LoadReasonAsImageLoad = 0x5,
     LoadReasonAsDataLoad = 0x6,
     LoadReasonUnknown = 0xFFFFFFFF,
} LDR_DLL_LOAD_REASON, *PLDR_DLL_LOAD_REASON;

typedef enum _LDR_HOT_PATCH_STATE
{
    LdrHotPatchBaseImage = 0,
    LdrHotPatchNotApplied = 1,
    LdrHotPatchAppliedReverse = 2,
    LdrHotPatchAppliedForward = 3,
    LdrHotPatchFailedToPatch = 4,
    LdrHotPatchStateMax = 5
} LDR_HOT_PATCH_STATE, *PLDR_HOT_PATCH_STATE;

typedef enum _LDR_DDAG_STATE
{
    LdrModulesMerged = -5,
    LdrModulesInitError = -4,
    LdrModulesSnapError = -3,
    LdrModulesUnloaded = -2,
    LdrModulesUnloading = -1,
    LdrModulesPlaceHolder = 0x0,
    LdrModulesMapping = 0x1,
    LdrModulesMapped = 0x2,
    LdrModulesWaitingForDependencies = 0x3,
    LdrModulesSnapping = 0x4,
    LdrModulesSnapped = 0x5,
    LdrModulesCondensed = 0x6,
    LdrModulesReadyToInit = 0x7,
    LdrModulesInitializing = 0x8,
    LdrModulesReadyToRun = 0x9,
} LDR_DDAG_STATE, *PLDR_DDAG_STATE;

typedef struct _LDR_SERVICE_TAG_RECORD
{
    struct _LDR_SERVICE_TAG_RECORD * Next;
    ULONG ServiceTag;
} LDR_SERVICE_TAG_RECORD, *PLDR_SERVICE_TAG_RECORD;

typedef struct _LDRP_CSLIST
{
    PSINGLE_LIST_ENTRY Tail;
} LDRP_CSLIST, *PLDRP_CSLIST;

typedef struct _LDR_DDAG_NODE
{
    LIST_ENTRY Modules;
    PLDR_SERVICE_TAG_RECORD ServiceTagList;
    ULONG LoadCount;
    ULONG LoadWhileUnloadingCount;
    ULONG LowestLink;
    LDRP_CSLIST Dependencies;
    LDRP_CSLIST IncomingDependencies;
    LDR_DDAG_STATE State;
    SINGLE_LIST_ENTRY CondenseLink;
    ULONG PreorderNumber;
} LDR_DDAG_NODE, *PLDR_DDAG_NODE;

typedef struct _LDR_DATA_TABLE_ENTRY
{
    LIST_ENTRY InLoadOrderLinks;
    LIST_ENTRY InMemoryOrderLinks;
    LIST_ENTRY InInitializationOrderLinks;
    PVOID DllBase;                             // Base address of the module
    PVOID EntryPoint;
    ULONG SizeOfImage;
    UNICODE_STRING FullDllName;
    UNICODE_STRING BaseDllName;

    union
    {
        UCHAR FlagGroup[4];
        ULONG Flags;
        struct
        {
            ULONG PackagedBinary:1;
            ULONG MarkedForRemoval:1;
            ULONG ImageDll:1;
            ULONG LoadNotificationsSent:1;
            ULONG TelemetryEntryProcessed:1;
            ULONG ProcessStaticImport:1;
            ULONG InLegacyLists:1;
            ULONG InIndexes:1;
            ULONG ShimDll:1;
            ULONG InExceptionTable:1;
            ULONG VerifierProvider:1;
            ULONG ShimEngineCalloutSent:1;
            ULONG LoadInProgress:1;
            ULONG LoadConfigProcessed:1;
            ULONG EntryProcessed:1;
            ULONG ProtectDelayLoad:1;
            ULONG AuxIatCopyPrivate:1;
            ULONG ReservedFlags3:1;
            ULONG DontCallForThreads:1;
            ULONG ProcessAttachCalled:1;
            ULONG ProcessAttachFailed:1;
            ULONG ScpInExceptionTable:1;
            ULONG CorImage:1;
            ULONG DontRelocate:1;
            ULONG CorILOnly:1;
            ULONG ChpeImage:1;
            ULONG ChpeEmulatorImage:1;
            ULONG ReservedFlags5:1;
            ULONG Redirected:1;
            ULONG ReservedFlags6:2;
            ULONG CompatDatabaseProcessed:1;
        };
    };

    USHORT ObsoleteLoadCount;
    USHORT TlsIndex;
    LIST_ENTRY HashLinks;
    ULONG TimeDateStamp;
    struct _ACTIVATION_CONTEXT * EntryPointActivationContext;
    PVOID Lock;
    PLDR_DDAG_NODE DdagNode;
    LIST_ENTRY NodeModuleLink;
    struct _LDRP_LOAD_CONTEXT * LoadContext;

    PVOID ParentDllBase;
    PVOID SwitchBackContext;
    RTL_BALANCED_NODE BaseAddressIndexNode;
    RTL_BALANCED_NODE MappingInfoIndexNode;
    ULONG_PTR OriginalBase;
    LARGE_INTEGER LoadTime;
    ULONG BaseNameHashValue;
    LDR_DLL_LOAD_REASON LoadReason;
    ULONG ImplicitPathOptions;
    ULONG ReferenceCount;
    ULONG DependentLoadFlags;
    UCHAR SigningLevel;
    ULONG CheckSum;
    PVOID ActivePatchImageBase;
    LDR_HOT_PATCH_STATE HotPatchState;

} LDR_DATA_TABLE_ENTRY, * PLDR_DATA_TABLE_ENTRY;

typedef struct _RTL_USER_PROCESS_PARAMETERS
{
    ULONG MaximumLength;                            // Should be set before call RtlCreateProcessParameters
    ULONG Length;                                   // Length of valid structure
    ULONG Flags;                                    // RTL_USER_PROC_PARAMS_XXX
    ULONG DebugFlags;

    PVOID ConsoleHandle;                            // HWND to console window associated with process (if any).
    ULONG ConsoleFlags;
    HANDLE StandardInput;
    HANDLE StandardOutput;
    HANDLE StandardError;

    CURDIR CurrentDirectory;                        // Specified in DOS-like symbolic link path, ex: "C:/WinNT/SYSTEM32"
    UNICODE_STRING DllPath;                         // DOS-like paths separated by ';' where system should search for DLL files.
    UNICODE_STRING ImagePathName;                   // Full path in DOS-like format to process'es file image.
    UNICODE_STRING CommandLine;                     // Command line
    PVOID Environment;                              // Pointer to environment block (see RtlCreateEnvironment)
    ULONG StartingX;
    ULONG StartingY;
    ULONG CountX;
    ULONG CountY;
    ULONG CountCharsX;
    ULONG CountCharsY;
    ULONG FillAttribute;                            // Fill attribute for console window
    ULONG WindowFlags;
    ULONG ShowWindowFlags;
    UNICODE_STRING WindowTitle;
    UNICODE_STRING DesktopInfo;                     // Name of WindowStation and Desktop objects, where process is assigned
    UNICODE_STRING ShellInfo;
    UNICODE_STRING RuntimeData;
    RTL_DRIVE_LETTER_CURDIR CurrentDirectores[0x20];

    ULONG EnvironmentSize;
    ULONG EnvironmentVersion;
    PVOID PackageDependencyData;
    ULONG ProcessGroupId;
    ULONG LoaderThreads;

} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS;

#ifdef _WIN64
#define PEB_GDI_HANDLES             60
#define TEB_SYSTEM_RESERVED         30
#define INSTRUMENTATION_ARRAY_SIZE  11
#define WIN64_ADD_PADDING(n, c)     UCHAR n[c];
#else
#define PEB_GDI_HANDLES             34
#define TEB_SYSTEM_RESERVED         26
#define INSTRUMENTATION_ARRAY_SIZE  9
#define WIN64_ADD_PADDING(n,c)      /* NOTHING */
#endif


#pragma pack(push, 8)
typedef struct _PEB
{
    /* 0x000 */ UCHAR InheritedAddressSpace;
    /* 0x001 */ UCHAR ReadImageFileExecOptions;
    /* 0x002 */ UCHAR BeingDebugged;

    /* 0x003 */ union
                {
                    UCHAR BitField;
                    struct
                    {
                        UCHAR ImageUsesLargePages : 1;
                        UCHAR IsProtectedProcess : 1;
                        UCHAR IsImageDynamicallyRelocated : 1;
                        UCHAR SkipPatchingUser32Forwarders : 1;
                        UCHAR IsPackagedProcess : 1;
                        UCHAR IsAppContainer : 1;
                        UCHAR IsProtectedProcessLight : 1;
                        UCHAR IsLongPathAwareProcess : 1;
                    };
                };

    WIN64_ADD_PADDING(Padding0, 4)

    /* 0x004 */ PVOID Mutant;
    /* 0x008 */ PVOID ImageBaseAddress;
    /* 0x00c */ PPEB_LDR_DATA Ldr;
    /* 0x010 */ PRTL_USER_PROCESS_PARAMETERS ProcessParameters;
    /* 0x014 */ PVOID SubSystemData;
    /* 0x018 */ HANDLE ProcessHeap;
    /* 0x01c */ PRTL_CRITICAL_SECTION FastPebLock;
    /* 0x020 */ PSLIST_HEADER AtlThunkSListPtr;
    /* 0x024 */ PVOID IFEOKey;

    /* 0x028 */ union
                {
                    ULONG CrossProcessFlags;
                    struct
                    {
                        ULONG ProcessInJob : 1;
                        ULONG ProcessInitializing : 1;
                        ULONG ProcessUsingVEH : 1;
                        ULONG ProcessUsingVCH : 1;
                        ULONG ProcessUsingFTH : 1;
                        ULONG ProcessPreviouslyThrottled : 1;
                        ULONG ProcessCurrentlyThrottled : 1;
                        ULONG ProcessImagesHotPatched : 1;
                        ULONG ReservedBits0 : 24;
                    };
                };

    WIN64_ADD_PADDING(Padding1, 4)

    /* 0x02C */ union
                {
                    PVOID KernelCallbackTable;
                    PVOID UserSharedInfoPtr;
                };

    /* 0x030 */ ULONG SystemReserved;

#ifdef _WIN64
                ULONG AtlThunkSListPtr32;
#else
    /* 0x034 */ PSLIST_HEADER AtlThunkSListPtr32;
#endif

    /* 0x038 */ PVOID ApiSetMap;
    /* 0x03c */ ULONG TlsExpansionCounter;

    WIN64_ADD_PADDING(Padding2, 4)

    /* 0x040 */ PRTL_BITMAP TlsBitmap;
    /* 0x044 */ ULONG TlsBitmapBits[2];
    /* 0x04c */ PVOID ReadOnlySharedMemoryBase;
    /* 0x050 */ PBYTE SharedData;
    /* 0x054 */ PVOID * ReadOnlyStaticServerData;
    /* 0x058 */ PVOID AnsiCodePageData;
    /* 0x05c */ PVOID OemCodePageData;
    /* 0x060 */ PVOID UnicodeCaseTableData;
    /* 0x064 */ ULONG NumberOfProcessors;
    /* 0x068 */ ULONG NtGlobalFlag;
    /* 0x070 */ LARGE_INTEGER CriticalSectionTimeout;
    /* 0x078 */ SIZE_T HeapSegmentReserve;
    /* 0x07c */ SIZE_T HeapSegmentCommit;
    /* 0x080 */ SIZE_T HeapDeCommitTotalFreeThreshold;
    /* 0x084 */ SIZE_T HeapDeCommitFreeBlockThreshold;
    /* 0x088 */ ULONG NumberOfHeaps;
    /* 0x08c */ ULONG MaximumNumberOfHeaps;
    /* 0x090 */ PHANDLE ProcessHeaps;
    /* 0x094 */ PVOID GdiSharedHandleTable;
    /* 0x098 */ PVOID ProcessStarterHelper;
    /* 0x09c */ ULONG GdiDCAttributeList;

    WIN64_ADD_PADDING(Padding3, 4)

    /* 0x0a0 */ PRTL_CRITICAL_SECTION LoaderLock;
    /* 0x0a4 */ ULONG OSMajorVersion;
    /* 0x0a8 */ ULONG OSMinorVersion;
    /* 0x0ac */ USHORT OSBuildNumber;
    /* 0x0ae */ USHORT OSCSDVersion;
    /* 0x0b0 */ ULONG OSPlatformId;
    /* 0x0b4 */ ULONG ImageSubsystem;
    /* 0x0b8 */ ULONG ImageSubsystemMajorVersion;
    /* 0x0bc */ ULONG ImageSubsystemMinorVersion;

    WIN64_ADD_PADDING(Padding4, 4)

    /* 0x0c0 */ ULONG_PTR ActiveProcessAffinityMask;
    /* 0x0c4 */ ULONG GdiHandleBuffer[PEB_GDI_HANDLES];
    /* 0x14c */ void(WINAPI * PostProcessInitRoutine)();
    /* 0x150 */ PVOID TlsExpansionBitmap;
    /* 0x154 */ ULONG TlsExpansionBitmapBits[32];
    /* 0x1d4 */ ULONG SessionId;

    WIN64_ADD_PADDING(Padding5, 4)

    /* 0x1d8 */ ULARGE_INTEGER AppCompatFlags;
    /* 0x1e0 */ ULARGE_INTEGER AppCompatFlagsUser;
    /* 0x1e8 */ PVOID pShimData;
    /* 0x1ec */ PVOID AppCompatInfo;
    /* 0x1f0 */ UNICODE_STRING CSDVersion;
    /* 0x1f8 */ struct _ACTIVATION_CONTEXT_DATA * ActivationContextData;
    /* 0x1fc */ struct _ASSEMBLY_STORAGE_MAP * ProcessAssemblyStorageMap;
    /* 0x200 */ struct _ACTIVATION_CONTEXT_DATA * SystemDefaultActivationContextData;
    /* 0x204 */ struct _PASSEMBLY_STORAGE_MAP * SystemAssemblyStorageMap;
    /* 0x208 */ ULONG MinimumStackCommit;
    /* 0x20c */ PVOID SparePointers[4];
    /* 0x21c */ ULONG SpareUlongs[5];
    /* 0x230 */ PVOID WerRegistrationData;
    /* 0x234 */ PVOID WerShipAssertPtr;
    /* 0x238 */ PVOID pUnused;
    /* 0x23c */ PVOID pImageHeaderHash;

    /* 0x240 */ union
                {
                    ULONG TracingFlags;
                    struct
                    {
                        ULONG HeapTracingEnabled : 1;
                        ULONG CritSecTracingEnabled : 1;
                        ULONG LibLoaderTracingEnabled : 1;
                        ULONG SpareTracingBits : 29;
                    };
                };

    WIN64_ADD_PADDING(Padding6, 4)

    /* 0x248 */ ULONGLONG CsrServerReadOnlySharedMemoryBase;
    /* 0x250 */ ULONG TppWorkerpListLock;
    /* 0x254 */ LIST_ENTRY TppWorkerpList;
    /* 0x25C */ void * WaitOnAddressHashTable[128];

} PEB, * PPEB;
#pragma pack(pop)


//
// Thread environment block
//

typedef struct _GDI_TEB_BATCH
{
    ULONG Offset : 31;
    ULONG HasRenderingCommand : 1;
    HANDLE HDC;
    ULONG Buffer[310];
} GDI_TEB_BATCH, * PGDI_TEB_BATCH;

typedef struct _ACTIVATION_CONTEXT_STACK
{
    struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME * ActiveFrame;
    LIST_ENTRY FrameListCache;
    ULONG Flags;
    ULONG NextCookieSequenceNumber;
    ULONG StackId;
} ACTIVATION_CONTEXT_STACK, * PACTIVATION_CONTEXT_STACK;

typedef struct _TEB
{
    /* 0x000 */ NT_TIB NtTib;
    /* 0x01c */ PVOID  EnvironmentPointer;
    /* 0x020 */ CLIENT_ID ClientId;
    /* 0x028 */ HANDLE ActiveRpcHandle;
    /* 0x02c */ PVOID  ThreadLocalStoragePointer;
    /* 0x030 */ PPEB   ProcessEnvironmentBlock;
    /* 0x034 */ ULONG  LastErrorValue;
    /* 0x038 */ ULONG  CountOfOwnedCriticalSections;
    /* 0x03c */ HANDLE CsrClientThread;
    /* 0x040 */ PVOID  Win32ThreadInfo;
    /* 0x044 */ ULONG  User32Reserved[26];
    /* 0x0ac */ ULONG  UserReserved[5];
    /* 0x0c0 */ PVOID  WOW32Reserved;
    /* 0x0c4 */ ULONG  CurrentLocale;
    /* 0x0c8 */ ULONG  FpSoftwareStatusRegister;
    /* 0x0cc */ PVOID  ReservedForDebuggerInstrumentation[16];
    /* 0x10c */ PVOID  SystemReserved1[TEB_SYSTEM_RESERVED];
    /* 0x174 */ CHAR PlaceholderCompatibilityMode;
    /* 0x175 */ UCHAR PlaceholderHydrationAlwaysExplicit;
    /* 0x176 */ CHAR PlaceholderReserved[10];
    /* 0x180 */ ULONG ProxiedProcessId;
    /* 0x184 */ ACTIVATION_CONTEXT_STACK _ActivationStack;
    /* 0x19c */ UCHAR  WorkingOnBehalfTicket[8];
    /* 0x1a4 */ NTSTATUS ExceptionCode;

    WIN64_ADD_PADDING(Padding0, 4)

    /* 0x1a8 */ PACTIVATION_CONTEXT_STACK ActivationContextStackPointer;
    /* 0x1ac */ ULONG_PTR InstrumentationCallbackSp;
    /* 0x1b0 */ ULONG_PTR InstrumentationCallbackPreviousPc;
    /* 0x1b4 */ ULONG_PTR InstrumentationCallbackPreviousSp;

#ifdef _WIN64
    ULONG TxFsContext;
    UCHAR InstrumentationCallbackDisabled;
    UCHAR UnalignedLoadStoreExceptions;
    WIN64_ADD_PADDING(Padding1, 2)
#else
    /* 0x1b8 */ UCHAR InstrumentationCallbackDisabled;
    /* 0x1b9 */ UCHAR SpareBytes[23];
    /* 0x1d0 */ ULONG TxFsContext;
#endif

    /* 0x1d4 */ GDI_TEB_BATCH GdiTebBatch;
    /* 0x6b4 */ CLIENT_ID RealClientId;
    /* 0x6bc */ PVOID GdiCachedProcessHandle;
    /* 0x6c0 */ ULONG GdiClientPID;
    /* 0x6c4 */ ULONG GdiClientTID;
    /* 0x6c8 */ PVOID GdiThreadLocalInfo;
    /* 0x6cc */ ULONG_PTR Win32ClientInfo[62];
    /* 0x7c4 */ PVOID glDispatchTable[233];
    /* 0xb68 */ ULONG_PTR glReserved1[29];
    /* 0xbdc */ PVOID glReserved2;
    /* 0xbe0 */ PVOID glSectionInfo;
    /* 0xbe4 */ PVOID glSection;
    /* 0xbe8 */ PVOID glTable;
    /* 0xbec */ PVOID glCurrentRC;
    /* 0xbf0 */ PVOID glContext;
    /* 0xbf4 */ NTSTATUS LastStatusValue;

    WIN64_ADD_PADDING(Padding2, 4)

    /* 0xbf8 */ UNICODE_STRING StaticUnicodeString;
    /* 0xc00 */ WCHAR StaticUnicodeBuffer[MAX_PATH + 1];

    WIN64_ADD_PADDING(Padding3, 6)

    /* 0xe0c */ PVOID DeallocationStack;
    /* 0xe10 */ PVOID TlsSlots[64];
    /* 0xf10 */ LIST_ENTRY TlsLinks;
    /* 0xf18 */ PVOID Vdm;
    /* 0xf1c */ PVOID ReservedForNtRpc;
    /* 0xf20 */ PVOID DbgSsReserved[2];
    /* 0xf28 */ ULONG HardErrorMode;

    WIN64_ADD_PADDING(Padding4, 4)

    /* 0xf2c */ PVOID Instrumentation[INSTRUMENTATION_ARRAY_SIZE];
    /* 0xf50 */ GUID  ActivityId;
    /* 0xf60 */ PVOID SubProcessTag;
    /* 0xf64 */ PVOID PerflibData;
    /* 0xf68 */ PVOID EtwTraceData;
    /* 0xf6c */ PVOID WinSockData;
    /* 0xf70 */ ULONG GdiBatchCount;

    /* 0xf74 */ union
                {
                    PROCESSOR_NUMBER CurrentIdealProcessor;
                    ULONG IdealProcessorValue;

                    struct
                    {
                        UCHAR ReservedPad0;
                        UCHAR ReservedPad1;
                        UCHAR ReservedPad2;
                        UCHAR IdealProcessor;
                    };
                };

    /* 0xf78 */ ULONG GuaranteedStackBytes;

    WIN64_ADD_PADDING(Padding5, 4)

    /* 0xf7c */ PVOID ReservedForPerf;
    /* 0xf80 */ PVOID ReservedForOle;
    /* 0xf84 */ ULONG WaitingOnLoaderLock;

    WIN64_ADD_PADDING(Padding6, 4)

    /* 0xf88 */ PVOID SavedPriorityState;
    /* 0xf8c */ ULONG ReservedForCodeCoverage;
    /* 0xf90 */ PVOID ThreadPoolData;
    /* 0xf94 */ PVOID * TlsExpansionSlots;

#ifdef _WIN64
    PVOID DeallocationBStore;
    PVOID BStoreLimit;
#endif

    /* 0xf98 */ ULONG MuiGeneration;
    /* 0xf9c */ ULONG IsImpersonating;
    /* 0xfa0 */ PVOID NlsCache;
    /* 0xfa4 */ PVOID pShimData;
    /* 0xfa8 */ ULONG HeapData;

    WIN64_ADD_PADDING(Padding7, 4)

    /* 0xfac */ HANDLE CurrentTransactionHandle;
    /* 0xfb0 */ struct _TEB_ACTIVE_FRAME * ActiveFrame;
    /* 0xfb4 */ PVOID FlsData;
    /* 0xfb8 */ PVOID PreferredLanguages;
    /* 0xfbc */ PVOID UserPrefLanguages;
    /* 0xfc0 */ PVOID MergedPrefLanguages;
    /* 0xfc4 */ ULONG MuiImpersonation;

    /* 0xfc8 */ union
                {
                    USHORT CrossTebFlags;
                    USHORT SpareCrossTebBits : 16;
                };

    /* 0xfca */ union
                {
                    USHORT SameTebFlags;
                    struct
                    {
                        USHORT SafeThunkCall : 1;
                        USHORT InDebugPrint : 1;
                        USHORT HasFiberData : 1;
                        USHORT SkipThreadAttach : 1;
                        USHORT WerInShipAssertCode : 1;
                        USHORT RanProcessInit : 1;
                        USHORT ClonedThread : 1;
                        USHORT SuppressDebugMsg : 1;
                        USHORT DisableUserStackWalk : 1;
                        USHORT RtlExceptionAttached : 1;
                        USHORT InitialThread : 1;
                        USHORT SessionAware : 1;
                        USHORT LoadOwner : 1;
                        USHORT LoaderWorker : 1;
                        USHORT SkipLoaderInit : 1;
                        USHORT SpareSameTebBits : 1;
                    };
                };

    /* 0xfcc */ PVOID TxnScopeEnterCallback;
    /* 0xfd0 */ PVOID TxnScopeExitCallback;
    /* 0xfd4 */ PVOID TxnScopeContext;
    /* 0xfd8 */ ULONG LockCount;
    /* 0xfdc */ ULONG WowTebOffset;
    /* 0xfe0 */ PVOID ResourceRetValue;
    /* 0xfe4 */ PVOID ReservedForWdf;
    /* 0xfe8 */ ULONGLONG ReservedForCrt;
    /* 0xff0 */ GUID EffectiveContainerId;

} TEB, * PTEB;

//
// Image load config from Windows 10 build 19041
//

// Flags for IMAGE_LOAD_CONFIG_DIRECTORY32_WIN10::GuardFlags
#ifndef IMAGE_GUARD_CF_INSTRUMENTED
#define IMAGE_GUARD_CF_INSTRUMENTED                    0x00000100 // Module performs control flow integrity checks using system-supplied support
#define IMAGE_GUARD_CFW_INSTRUMENTED                   0x00000200 // Module performs control flow and write integrity checks
#define IMAGE_GUARD_CF_FUNCTION_TABLE_PRESENT          0x00000400 // Module contains valid control flow target metadata
#define IMAGE_GUARD_SECURITY_COOKIE_UNUSED             0x00000800 // Module does not make use of the /GS security cookie
#define IMAGE_GUARD_PROTECT_DELAYLOAD_IAT              0x00001000 // Module supports read only delay load IAT
#define IMAGE_GUARD_DELAYLOAD_IAT_IN_ITS_OWN_SECTION   0x00002000 // Delayload import table in its own .didat section (with nothing else in it) that can be freely reprotected
#define IMAGE_GUARD_CF_EXPORT_SUPPRESSION_INFO_PRESENT 0x00004000 // Module contains suppressed export information. This also infers that the address taken
                                                                  // taken IAT table is also present in the load config.
#define IMAGE_GUARD_CF_ENABLE_EXPORT_SUPPRESSION       0x00008000 // Module enables suppression of exports
#define IMAGE_GUARD_CF_LONGJUMP_TABLE_PRESENT          0x00010000 // Module contains longjmp target information
#define IMAGE_GUARD_RF_INSTRUMENTED                    0x00020000 // Module contains return flow instrumentation and metadata
#define IMAGE_GUARD_RF_ENABLE                          0x00040000 // Module requests that the OS enable return flow protection
#define IMAGE_GUARD_RF_STRICT                          0x00080000 // Module requests that the OS enable return flow protection in strict mode
#define IMAGE_GUARD_CF_FUNCTION_TABLE_SIZE_MASK        0xF0000000 // Stride of Guard CF function table encoded in these bits (additional count of bytes per element)
#define IMAGE_GUARD_CF_FUNCTION_TABLE_SIZE_SHIFT       28         // Shift to right-justify Guard CF function table stride

typedef struct _IMAGE_LOAD_CONFIG_CODE_INTEGRITY
{
    WORD    Flags;                      // Flags to indicate if CI information is available, etc.
    WORD    Catalog;                    // 0xFFFF means not available
    DWORD   CatalogOffset;
    DWORD   Reserved;                   // Additional bitmask to be defined later
} IMAGE_LOAD_CONFIG_CODE_INTEGRITY, * PIMAGE_LOAD_CONFIG_CODE_INTEGRITY;
#endif

#define CREATE_IMAGE_LOAD_CONFIG_DIRECTORY(cfg_name, sztype)        \
typedef struct _##cfg_name                                          \
{                                                                   \
    DWORD   Size;                                                   \
    DWORD   TimeDateStamp;                                          \
    WORD    MajorVersion;                                           \
    WORD    MinorVersion;                                           \
    DWORD   GlobalFlagsClear;                                       \
    DWORD   GlobalFlagsSet;                                         \
    DWORD   CriticalSectionDefaultTimeout;                          \
